export const DEMO_JSON = `{
    "网络划分": {
        "DMZ区": {"包含网段": ["10.0.20.0/24"]},
        "内网服务器区": {"包含网段": ["10.1.12.0/24"]},
        "信息安全管理中心": {"包含网段": ["10.2.40.0/24"]},
        "办公区": {"包含网段": ["192.168.10.0/24"]},
        "二级公司": {"包含网段": ["11.0.60.0/24"]},
        "水厂客户端": {"包含网段": ["12.0.70.0/24"]},
        "水厂应用系统": {"包含网段": ["12.1.71.0/24"]},
        "生产控制区": {"包含网段": ["13.0.80.0/24"]},
        "开发测试区": {"包含网段": ["192.167.20.0/24"]},
        "运营商": {"包含网段": ["192.166.50.0/24", "192.166.51.0/24", "192.166.52.0/24"]}
    },

    "防火墙": {
        "DMZ区to运营商防火墙": {"实例规格": "nano-firewall", "镜像": "vyos", "子网": ["20.10.12.11", "20.10.11.11"]},
        "DMZ区核心防火墙": {"实例规格": "mini-firewall", "镜像": "vyos", "子网": ["21.10.12.11", "21.10.11.11", "21.10.13.11", "21.10.14.11", "21.10.15.11"]},
        "内网服务区防火墙": {"实例规格": "nano-firewall", "镜像": "vyos", "子网": ["22.10.12.11", "22.10.11.11"]},
        "信息安全管理中心防火墙": {"实例规格": "nano-firewall", "镜像": "vyos", "子网": ["23.10.12.11", "23.10.11.11"]},
        "二级公司to运营商防火墙": {"实例规格": "nano-firewall", "镜像": "vyos", "子网": ["24.10.12.11", "24.10.11.11"]},
        "水厂防火墙": {"实例规格": "nano-firewall", "镜像": "vyos", "子网": ["25.10.12.11", "25.10.11.11", "25.10.13.11"]},
        "生产控制区防火墙": {"实例规格": "nano-firewall", "镜像": "vyos", "子网": ["26.10.12.11", "26.10.11.11"]}
    },

    "路由器交换机": {
        "DMZ区路由器": {"接入网段": ["10.0.20.0/24"], "接入防火墙": ["20.10.12.11", "21.10.12.11"]},
        "内网服务器区路由器": {"接入网段": ["10.1.12.0/24"], "接入防火墙": ["22.10.12.11"]},
        "信息安全管理中心路由器": {"接入网段": ["10.2.40.0/24"], "接入防火墙": ["23.10.12.11"]},
        "运营商DMZ区路由器": {"接入网段": ["192.166.50.0/24"], "接入防火墙": ["20.10.11.11"]},
        "运营商DMZ核心路由器": {"接入网段": ["192.166.51.0/24"], "接入防火墙": ["21.10.11.11"]},
        "核心路由器": {"接入网段": ["192.167.20.0/24"], "接入防火墙": ["21.10.15.11", "22.10.11.11", "23.10.11.11", "22.10.12.11"]},
        "运营商二级公司路由器": {"接入网段": ["192.166.52.0/24"], "接入防火墙": ["24.10.12.11"]},
        "DMZ核心二级公司路由器": {"接入网段": ["11.0.60.0/24"], "接入防火墙": ["21.10.13.11", "24.10.11.11"]},
        "DMZ核心水厂路由器": {"接入网段": null, "接入防火墙": ["21.10.14.11", "25.10.12.11"]},
        "水厂客户端路由器": {"接入网段": ["12.0.70.0/24"], "接入防火墙": ["25.10.11.11"]},
        "水厂应用系统路由器": {"接入网段": ["12.1.71.0/24"], "接入防火墙": ["25.10.13.11", "26.10.12.11"]},
        "生产控制区路由器": {"接入网段": ["13.0.80.0/24"], "接入防火墙": ["26.10.11.11"]}
    },

    "实例": {
        "DMZ区": [
            {"集团门户网站": {"镜像": "portal-website", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"邮件系统": {"镜像": "mail-system", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"VPN": {"镜像": "vpn-server", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"DNS服务器": {"镜像": "dns-server", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}}
        ],
        "内网服务器区": [
            {"财务系统": {"镜像": "financial-system", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"考勤系统": {"镜像": "attendance-system", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"OA系统": {"镜像": "oa-system", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"调度管理系统": {"镜像": "scheduling-system", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"压力检测": {"镜像": "pressure-detection", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"数据库": {"镜像": "database-server", "实例规格": "medium-server", "接入网段": null, "指定IP": null}},
            {"文件服务器": {"镜像": "file-server", "实例规格": "medium-server", "接入网段": null, "指定IP": null}},
            {"监测系统": {"镜像": "monitoring-system", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"备份数据库": {"镜像": "backup-database", "实例规格": "medium-server", "接入网段": null, "指定IP": null}}
        ],
        "信息安全管理中心": [
            {"日志审计": {"镜像": "log-audit", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"EDR": {"镜像": "edr-system", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"堡垒机": {"镜像": "bastion-host", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"运维终端": {"镜像": "operation-terminal", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}}
        ],
        "办公区": [
            {"内网客户端1": {"镜像": "office-client", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"内网客户端2": {"镜像": "office-client", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"内网客户端3": {"镜像": "office-client", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"内网客户端4": {"镜像": "office-client", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}}
        ],
        "二级公司": [
            {"前置机": {"镜像": "frontier-server", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"分公司客户端": {"镜像": "branch-client", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"应用系统": {"镜像": "branch-application", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}}
        ],
        "水厂客户端": [
            {"水厂客户端应用": {"镜像": "water-client-app", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}}
        ],
        "水厂应用系统": [
            {"水厂应用系统控制中心": {"镜像": "water-control-center", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}}
        ],
        "生产控制区": [
            {"供水站控工作站": {"镜像": "water-station-control", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"工控蜜罐": {"镜像": "industrial-honeypot", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}}
        ],
        "开发测试区": [
            {"代码服务器": {"镜像": "code-server", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"域服务器": {"镜像": "domain-server", "实例规格": "small-workstation", "接入网段": null, "指定IP": null}},
            {"开发客户端1": {"镜像": "developer-client", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"开发客户端2": {"镜像": "developer-client", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}}
        ],
        "运营商": [
            {"运营商应用1": {"镜像": "carrier-app", "实例规格": "tiny-pc", "接入网段": "192.166.50.0/24", "指定IP": "192.166.50.12"}},
            {"运营商应用2": {"镜像": "carrier-app", "实例规格": "tiny-pc", "接入网段": "192.166.51.0/24", "指定IP": "192.166.51.13"}},
            {"运营商应用3": {"镜像": "carrier-app", "实例规格": "tiny-pc", "接入网段": "192.166.52.0/24", "指定IP": "192.166.52.14"}},
            {"运营商应用4": {"镜像": "carrier-app", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"运营商应用5": {"镜像": "carrier-app", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"运营商应用6": {"镜像": "carrier-app", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"运营商应用7": {"镜像": "carrier-app", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}},
            {"运营商应用8": {"镜像": "carrier-app", "实例规格": "tiny-pc", "接入网段": null, "指定IP": null}}
        ]
    }
}      `